paper/use_diagnositic_or_use_splain.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>use diagnostic 或者 use splain</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="use diagnostic 或者 use splain"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-04-07T20:00+0800"/>
<meta name="author" content="GRC"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">use diagnostic 或者 use splain</h1>

<p>如果Perl程序发出警告或者报错，而你并不理解，Perl给你的报错信息。
那么你有几种选择。
</p>
<ul>
<li>在某一个channels中提问。
</li>
<li>Check out the alternative,and hopefully beginner friendly explanations 
</li>
</ul>

<p>on the Perl Maven site。
</p><ul>
<li>使用use diagnostic 或者use splain。
</li>
</ul>


<p>
如果你觉得Perl默认提供的警告或者报错信息，太过短小精悍。那么你可以要求Perl提供更长的
解释。你可以在程序上添加 use diagnostics; （建议只在研发过程中使用）。
或者你也可以把错误保存到一个文件中，然后使用use splain.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 0不能做除数</a></li>
<li><a href="#sec-2">2 use diagnostics</a></li>
<li><a href="#sec-3">3 splain</a></li>
<li><a href="#sec-4">4 splain in a pipe</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 0不能做除数</h2>
<div class="outline-text-2" id="text-1">

<p>让我们来看一个例子：
</p>


<pre class="example">$x=0;
print 1/$x;
</pre>

<p>
如果你运行上面的代码，你会得到错误：
Illegal division by zero at x.pl line2。
</p>
<p>
我知道对于大不人来说，上面的内容足够可以让人意识到自己的错误。但是问题的
关键在于，0是如何成为分母的。
</p>
<p>
所以这个例子依然是一个好例子，来展现如何得到更多，更详细的解释。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> use diagnostics</h2>
<div class="outline-text-2" id="text-2">

<p>在上述代码上添加：use diagnostics:
</p>


<pre class="example">use diagnostics;

$x=0;
print 1/$x;
</pre>

<p>
结果是这样的：
</p>


<pre class="example">Illegal division by zero at C:/Users/GRC/Desktop/a.pl line 4 (#1)
    (F) You tried to divide a number by 0.  Either something was wrong in
    your logic, or you need to put a conditional in to guard against
    meaningless input.

Uncaught exception from user code:
        Illegal division by zero at C:/Users/GRC/Desktop/a.pl line 4.
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> splain</h2>
<div class="outline-text-2" id="text-3">

<p>splain 是一个Perl附带的命令行工具。
我们运行上述程序（不加use diagnostics）但是我们把错误输出到一个文件中。
</p>


<pre class="example">perl x.pl 2 &gt; x.err
</pre>

<p>
然后我们运行：
</p>


<pre class="example">splain x.err
</pre>

<p>
结果会输出：
</p>


<pre class="example">Illegal division by zero at x.pl line 2 (#1)
    (F) You tried to divide a number by 0.  Either something was wrong in
    your logic, or you need to put a conditional in to guard against
    meaningless input.
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> splain in a pipe</h2>
<div class="outline-text-2" id="text-4">

<p>Linux/Unix 的高级使用者可以用管道命令得到错误信息，而不用把他们保存到一个文件中。
</p>


<pre class="example">perl x.pl 2&gt;&amp;1 | splain
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-04-07T20:00+0800</p>
<p class="author">Author: GRC</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
